app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'Admin'
 LIMIT 1
---
    public function process()
    {
        $userModel = new UserModel();

        $user = $userModel
                ->where('username', $this->request->getPost('username'))
                ->first();