app/Controllers/Barang.php

SELECT *
FROM `barang`
ORDER BY `tanggal` DESC
SELECT *
FROM `barang_logs`
WHERE `barang_id` IN ('34','33','32','31','30','29','28','27','26','25','24','23','22','21','20','19','18','17','16','15','14','13','12','11','10','9','8','7','6','5','4','3','2','1')
ORDER BY `created_at` ASC
---
public function index()
{
    // ========== DATA BARANG ==========
    $keyword = $this->request->getGet('keyword');
    $builder = $this->barang;

    if ($keyword) {
        $builder = $builder
            ->groupStart()
                ->like('no_agenda', $keyword)
                ->orLike('no_spb', $keyword)
                ->orLike('tanggal', $keyword)
                ->orLike('nama_barang', $keyword)
                ->orLike('jumlah', $keyword)
                ->orLike('satuan', $keyword)
                ->orLike('asal', $keyword)
                ->orLike('tujuan', $keyword)
                ->orLike('tipe', $keyword)
                ->orLike('is_partial', $keyword)
                ->orLike('keterangan', $keyword)
                ->orLike('status', $keyword)
            ->groupEnd();
    }

    $barangs = $builder->orderBy('tanggal', 'DESC')->findAll();

    $barangIds = array_column($barangs, 'id');

    $logs = [];
    if (!empty($barangIds)) {
        $logData = $this->barangLog
            ->whereIn('barang_id', $barangIds)
            ->orderBy('created_at', 'ASC')
            ->findAll();