app/Controllers/DAdmin.php

public function index()
{
    $db = \Config\Database::connect();

    $totalUsers  = $db->table('users')->countAll();

    $totalMasuk  = $db->table('barang')->like('no_agenda','M-','after')->countAllResults();
    $totalKeluar = $db->table('barang')->like('no_agenda','K-','after')->countAllResults();

    $today = date('Y-m-d');
    $masukHariIni  = $db->table('barang')
                        ->like('no_agenda','M-','after')
                        ->where('DATE(tanggal)', $today)
                        ->countAllResults();

    $keluarHariIni = $db->table('barang')
                        ->like('no_agenda','K-','after')
                        ->where('DATE(tanggal)', $today)
                        ->countAllResults();

    $totalAktivitas = $db->table('barang_logs')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `no_agenda` LIKE 'M-%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `no_agenda` LIKE 'K-%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `no_agenda` LIKE 'M-%' ESCAPE '!'
AND DATE(tanggal) = '2026-02-13'
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `no_agenda` LIKE 'K-%' ESCAPE '!'
AND DATE(tanggal) = '2026-02-13'
SELECT COUNT(*) AS `numrows` FROM `barang_logs`