app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $data['users'] = $this->user
                ->like('nama_petugas', $keyword)
                ->orLike('username', $keyword)
                ->orLike('role', $keyword)
                ->orLike('created_at', $keyword)
                ->findAll();
        } else {
            $data['users'] = $this->user->findAll();